<a href="https://colab.research.google.com/github/PorasS/AI/blob/master/pandasTut.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas library provides the necessary data structures, required to handle tabular data.**

In [ ]:
#simple data frame
import pandas as pd;

df = pd.read_csv("/content/sample_data/auto-mpg.csv");
display(df[0:5])

    mpg  cylinders  displacement  ... model year  origin                   car name
0  18.0          8         307.0  ...         70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...         70       1          buick skylark 320
2  18.0          8         318.0  ...         70       1         plymouth satellite
3  16.0          8         304.0  ...         70       1              amc rebel sst
4  17.0          8         302.0  ...         70       1                ford torino

[5 rows x 9 columns]

In [ ]:
#Strip non-numerics
df = df.select_dtypes(include=['int','float']);

display(df[0:5])

    mpg  cylinders  displacement  weight  acceleration  model year  origin
0  18.0          8         307.0    3504          12.0          70       1
1  15.0          8         350.0    3693          11.5          70       1
2  18.0          8         318.0    3436          11.0          70       1
3  16.0          8         304.0    3433          12.0          70       1
4  17.0          8         302.0    3449          10.5          70       1

In [ ]:
headers = list(df.columns.values);
print(headers);

['mpg', 'cylinders', 'displacement', 'weight', 'acceleration', 'model year', 'origin']

In [ ]:
#Generate mean, var and  std
fields=[];

for field in headers:
  fields.append({'name': field,
                'mean':df[field].mean(),
                'var':df[field].var(),
                'sdev':df[field].std()});

for field in fields:
  print(field);

{'name': 'mpg', 'mean': 23.514572864321615, 'var': 61.089610774274405, 'sdev': 7.815984312565782}
{'name': 'cylinders', 'mean': 5.454773869346734, 'var': 2.8934154399199943, 'sdev': 1.7010042445332094}
{'name': 'displacement', 'mean': 193.42587939698493, 'var': 10872.199152247364, 'sdev': 104.26983817119581}
{'name': 'weight', 'mean': 2970.424623115578, 'var': 717140.9905256768, 'sdev': 846.8417741973271}
{'name': 'acceleration', 'mean': 15.568090452261291, 'var': 7.604848233611381, 'sdev': 2.7576889298126757}
{'name': 'model year', 'mean': 76.01005025125629, 'var': 13.672442818627143, 'sdev': 3.697626646732623}
{'name': 'origin', 'mean': 1.5728643216080402, 'var': 0.6432920268850575, 'sdev': 0.8020548777266163}

Converting fields to dataFrame

In [ ]:
df2 = pd.DataFrame(fields);
display(df2);

           name         mean            var        sdev
0           mpg    23.514573      61.089611    7.815984
1     cylinders     5.454774       2.893415    1.701004
2  displacement   193.425879   10872.199152  104.269838
3        weight  2970.424623  717140.990526  846.841774
4  acceleration    15.568090       7.604848    2.757689
5    model year    76.010050      13.672443    3.697627
6        origin     1.572864       0.643292    0.802055

**Dealing with Missing Values:**
To deal with missing values, common practice is to replace missing values with the median value for that column.
Median is better to use in place of null values, as median is not sensitive to outliers, as mean is sensitive to outliers

In [ ]:
#check if there is any null value in horsepower column
import os;
import pandas as pd;

df = pd.read_csv("/content/sample_data/auto-mpg.csv", na_values=['NA','?']);

print(f"horsepower has na? {pd.isnull(df['horsepower']).values.any()}")

horsepower has na? True

In [ ]:
#filling missing values
#calculating the median for the horsepower column
median = df['horsepower'].median();
df['horsepower']=df['horsepower'].fillna(median);

#df = df.dropna() # we can also simply drop na values
print(f"horsepower has na? {pd.isnull(df['horsepower']).values.any()}");

horsepower has na? False

**Dealing with Outliers**: outliers are usually defined as a values that is several standard deviation away from the mean.

In [ ]:
#Remove all rows where the specified, column is +/- standard deviation

def remove_outlier(df, name, sd):
  drop_rows = df.index[(np.abs(df[name]-df[name].mean())>= (sd * df[name].std()))]
  print(f"drop_rows: {drop_rows}")
  df.drop(drop_rows, axis=0, inplace=True)

The code below will drop every row from the dataset, where the horsepower is more than 2 standard deviation above or below the mean.

In [ ]:
import pandas as pd;
import os;
import numpy as np;
from sklearn import metrics;
from scipy.stats import zscore;

df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?']);

# display(df[0:5])

# create feature vector
med  = df['horsepower'].median();
df['horsepower'] = df['horsepower'].fillna(med);

# drop the name column
# df.drop('name',1,inplace=True);

# Drop outliers in horsepower
print("Length before MPG outlier dropped: {}".format(len(df)));
remove_outlier(df,'mpg',2)
print("Length after MPG outlier dropped: {}".format(len(df)));

display(df[0:5]);

Length before MPG outlier dropped: 398
drop_rows: Int64Index([244, 247, 309, 322, 324, 325, 326, 329, 330, 394], dtype='int64')
Length after MPG outlier dropped: 388

    mpg  cylinders  displacement  ...  model year  origin                   car name
0  18.0          8         307.0  ...          70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70       1          buick skylark 320
2  18.0          8         318.0  ...          70       1         plymouth satellite
3  16.0          8         304.0  ...          70       1              amc rebel sst
4  17.0          8         302.0  ...          70       1                ford torino

[5 rows x 9 columns]

**Dropping Fields**: Its pretty easy to drop fields in pandas.

In [ ]:
import os
import pandas as pd
df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])
display(df[0:5])

    mpg  cylinders  displacement  ...  model year  origin                   car name
0  18.0          8         307.0  ...          70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70       1          buick skylark 320
2  18.0          8         318.0  ...          70       1         plymouth satellite
3  16.0          8         304.0  ...          70       1              amc rebel sst
4  17.0          8         302.0  ...          70       1                ford torino

[5 rows x 9 columns]

In [ ]:
print(f'Before column drop: {list(df.columns)}')
df.drop('car name',1, inplace=True)
print(f'After Column drop: {list(df.columns)}')

In [ ]:
display(df[0:5])

    mpg  cylinders  displacement  ...  acceleration  model year  origin
0  18.0          8         307.0  ...          12.0          70       1
1  15.0          8         350.0  ...          11.5          70       1
2  18.0          8         318.0  ...          11.0          70       1
3  16.0          8         304.0  ...          12.0          70       1
4  17.0          8         302.0  ...          10.5          70       1

[5 rows x 8 columns]

**Concatenating Rows and Columns:**
Rows and columns can be concatenate together to form a new  dataframe

In [ ]:
import os
import pandas as pd

df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])
col_horsepower = df['horsepower']
col_carName = df['car name']

# axis=1, always means columns, as we are concatenating two columns
result = pd.concat([col_horsepower, col_carName],axis=1)
display(result[0:5])

   horsepower                   car name
0       130.0  chevrolet chevelle malibu
1       165.0          buick skylark 320
2       150.0         plymouth satellite
3       150.0              amc rebel sst
4       140.0                ford torino

Concat function can also concat two rows together

In [ ]:
# create a new dataframe from first two rows and last two rows
import os
import pandas as pd

df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])
result = pd.concat([df[0:2],df[-2:]], axis=0)
display(result)

      mpg  cylinders  ...  origin                   car name
0    18.0          8  ...       1  chevrolet chevelle malibu
1    15.0          8  ...       1          buick skylark 320
396  28.0          4  ...       1                ford ranger
397  31.0          4  ...       1                 chevy s-10

[4 rows x 9 columns]

**Training and Validation:**
Divide the dataset into traning and validation set

In [ ]:
import os
import pandas as pd
import numpy as np

df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])
print(f'before random index: {df[0:5]}')
df = df.reindex(np.random.permutation(df.index)) # usually a good idea
print(f'after random index: {df[0:5]}')

before random index:     mpg  cylinders  displacement  ...  model year  origin                   car name
0  18.0          8         307.0  ...          70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70       1          buick skylark 320
2  18.0          8         318.0  ...          70       1         plymouth satellite
3  16.0          8         304.0  ...          70       1              amc rebel sst
4  17.0          8         302.0  ...          70       1                ford torino

[5 rows x 9 columns]
after random index:       mpg  cylinders  ...  origin                  car name
352  29.9          4  ...       1            ford escort 2h
368  27.0          4  ...       1  chevrolet cavalier wagon
98   16.0          6  ...       1     chevrolet nova custom
353  33.0          4  ...       2          volkswagen jetta
59   23.0          4  ...       2         volkswagen type 3

[5 rows x 9 columns]

In [ ]:
mask = np.random.rand(len(df)) <0.8 # 80%  data
trainDf= pd.DataFrame(df[mask])
validationDf = pd.DataFrame(df[~mask])

print(f'trainDf len: {len(trainDf)}')
print(f'vaildationDf len: {len(validationDf)}')

trainDf len: 329
vaildationDf len: 69

**Converting a dataframe to matrix:**
A neural network requires a numeric matrix. The values property of DataFrame is used to convert to a matrix

In [ ]:
display(df[0:5])

      mpg  cylinders  ...  origin                  car name
352  29.9          4  ...       1            ford escort 2h
368  27.0          4  ...       1  chevrolet cavalier wagon
98   16.0          6  ...       1     chevrolet nova custom
353  33.0          4  ...       2          volkswagen jetta
59   23.0          4  ...       2         volkswagen type 3

[5 rows x 9 columns]

If we want to convert only few columns, the following code gets handy

In [ ]:
df.values

array([[29.9, 4, 98.0, ..., 81, 1, 'ford escort 2h'],
       [27.0, 4, 112.0, ..., 82, 1, 'chevrolet cavalier wagon'],
       [16.0, 6, 250.0, ..., 73, 1, 'chevrolet nova custom'],
       ...,
       [29.0, 4, 85.0, ..., 76, 1, 'chevrolet chevette'],
       [32.4, 4, 108.0, ..., 81, 3, 'toyota corolla'],
       [31.5, 4, 89.0, ..., 78, 2, 'volkswagen scirocco']], dtype=object)

In [ ]:
df[['mpg','cylinders','displacement','horsepower','weight','acceleration','model year', 'origin']].values

array([[ 29.9,   4. ,  98. , ...,  20.7,  81. ,   1. ],
       [ 27. ,   4. , 112. , ...,  18.6,  82. ,   1. ],
       [ 16. ,   6. , 250. , ...,  18. ,  73. ,   1. ],
       ...,
       [ 29. ,   4. ,  85. , ...,  22.2,  76. ,   1. ],
       [ 32.4,   4. , 108. , ...,  16.8,  81. ,   3. ],
       [ 31.5,   4. ,  89. , ...,  14.9,  78. ,   2. ]])

**Saving a data frame to a csv**

In [ ]:
import os
import pandas as pd
import numpy as np

path="/content/sample_data/"
df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])

filename_write = os.path.join(path,"auto-mpg-shuffle.csv")
df = df.reindex(np.random.permutation(df.index))
df.to_csv(filename_write, index=False) #Specify index = False is not write index on each row
print("Done")

Done

**Saving DataFrame to Pickel**
Pickel is more precise as compared to csv, as csv tends to lose precesion while converting

In [ ]:
import os
import pandas as pd
import numpy as np
import pickle

path="/content/sample_data/"
df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])

filename_write = os.path.join(path,"auto-mpg-shuffle.pkl")
df = df.reindex(np.random.permutation(df.index))

with open (filename_write,"wb") as fp:
  pickle.dump(df,fp)

print("Done")

Done

Loading the pickel file back into a memory

In [ ]:
import os
import pandas as pd
import numpy as np
import pickle

path="/content/sample_data/"
df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])

filename_read = os.path.join(path,"auto-mpg-shuffle.pkl")

with open(filename_read,"rb") as fp:
  df = pickle.load(fp)

display(df[0:5])

      mpg  cylinders  ...  origin                  car name
58   25.0          4  ...       1        dodge colt hardtop
95   12.0          8  ...       1  buick electra 225 custom
124  11.0          8  ...       1          oldsmobile omega
381  36.0          4  ...       3              honda accord
353  33.0          4  ...       2          volkswagen jetta

[5 rows x 9 columns]

**Categorical and Continous values:**
There are four types of data:
Character Data(Strings)
>**Nominal**: Individual discrete item, no order. ex: color, zip code, shape

>**Ordinal**: Individual descrete item, that can be ordered. ex: Grade Level, Job Title

Numeric Data:
>**Interval**: Numeric values, no defined start. ex: temperature

>**Ratio**: Numeric values, clearly defined start. ex: speed, we can say, the first can is going twice as fast as second.

**Encoding Continous values:**
One common transformation is to normalize the inputs. One very common machine learning normalization is the z-score.


>z = (x  ) / 

>=x' = x1+x2+x3+....+xn/n

The standard deviation is calculated as follows:
> s =  sqrt(1/n summation(square(xi-))

The z score tells you how many standard deviations from the mean your score is. 0 z-score means exactly at the mean, -1 z-score means one std below the mean and 1 z-score means one std above the mean.

Note: z-score above below -3 to 3, are very rare, these are outliers.

In [ ]:
# replaces mpg with z-score
import os
import pandas as pd
from scipy.stats import zscore

df = pd.read_csv("/content/sample_data/auto-mpg.csv",na_values=['NA','?'])

display(df['mpg'][0:5])

0    18.0
1    15.0
2    18.0
3    16.0
4    17.0
Name: mpg, dtype: float64

In [ ]:
print("after applying zscore")
df['mpg'] = zscore(df['mpg'])
display(df[0:5])

after applying zscore

        mpg  cylinders  ...  origin                   car name
0 -0.706439          8  ...       1  chevrolet chevelle malibu
1 -1.090751          8  ...       1          buick skylark 320
2 -0.706439          8  ...       1         plymouth satellite
3 -0.962647          8  ...       1              amc rebel sst
4 -0.834543          8  ...       1                ford torino

[5 rows x 9 columns]

**Encoding categorical values as dummies:**
Also called one-hot encoding

In [ ]:
import pandas as pd

df = pd.read_csv("https://data.heatonresearch.com/data/t81-558/jh-simple-dataset.csv",na_values=['NA','?'])
display(df[0:5])

   id job area   income  ...  pop_dense  retail_dense     crime  product
0   1  vv    c  50876.0  ...   0.885827      0.492126  0.071100        b
1   2  kd    c  60369.0  ...   0.874016      0.342520  0.400809        c
2   3  pe    c  55126.0  ...   0.944882      0.724409  0.207723        b
3   4  11    c  51690.0  ...   0.889764      0.444882  0.361216        b
4   5  kl    d  28347.0  ...   0.744094      0.661417  0.068033        a

[5 rows x 14 columns]

In [ ]:
areas = list(df['area'].unique())
print(f'Number of areas: {len(areas)}')
print(f'areas: {areas}')

Number of areas: 4
areas: ['c', 'd', 'a', 'b']

There are 4 unique values in areas column. To encode these to dummy variables we would use four columns, each of which would represent one of the areas. Value for 'a' becomes [1,0,0,0], value for 'b' becomes [0,1,0,0], c= [0,0,1,0] and d=[0,0,0,1].

In [ ]:
dummies = pd.get_dummies(['a','b','c','d'], prefix='area')
print(dummies)

   area_a  area_b  area_c  area_d
0       1       0       0       0
1       0       1       0       0
2       0       0       1       0
3       0       0       0       1

To encode the 'area' column we use the following. It is  necessary to merge these dummies back into the dataframe.

In [ ]:
dummies = pd.get_dummies(df['area'],prefix='area')
print(dummies[0:10])

   area_a  area_b  area_c  area_d
0       0       0       1       0
1       0       0       1       0
2       0       0       1       0
3       0       0       1       0
4       0       0       0       1
5       0       0       1       0
6       0       0       0       1
7       1       0       0       0
8       0       0       1       0
9       1       0       0       0

In [ ]:
df = pd.concat([df,dummies], axis=1)
display(df[0:10])

   id job area   income     aspect  ...  product  area_a  area_b  area_c  area_d
0   1  vv    c  50876.0  13.100000  ...        b       0       0       1       0
1   2  kd    c  60369.0  18.625000  ...        c       0       0       1       0
2   3  pe    c  55126.0  34.766667  ...        b       0       0       1       0
3   4  11    c  51690.0  15.808333  ...        b       0       0       1       0
4   5  kl    d  28347.0  40.941667  ...        a       0       0       0       1
5   6  e2    c  70854.0  40.400000  ...        d       0       0       1       0
6   7  kl    d  38726.0  30.975000  ...        f       0       0       0       1
7   8  nb    a  55162.0  26.966667  ...        b       1       0       0       0
8   9  al    c  67311.0  32.383333  ...        c       0       0       1       0
9  10  pe    a  63344.0  38.233333  ...        c       1       0       0       0

[10 rows x 18 columns]

In [ ]:
df.drop('area',axis=1,inplace=True)
display(df[0:5])

   id job   income     aspect  ...  area_a  area_b  area_c  area_d
0   1  vv  50876.0  13.100000  ...       0       0       1       0
1   2  kd  60369.0  18.625000  ...       0       0       1       0
2   3  pe  55126.0  34.766667  ...       0       0       1       0
3   4  11  51690.0  15.808333  ...       0       0       1       0
4   5  kl  28347.0  40.941667  ...       0       0       0       1

[5 rows x 17 columns]

Another method to deal with categorical data other rhan dummies.
>**Target Encoding:** Target encoding can some times increase the predictive power of machine learning model. But it also increases the risk of overfitting. It is a popular techinque for kaggle competitions.

Can be use when the output of the machine learning model is numeric (regression).

In [ ]:
# Create a small sample data set
import pandas as pd
import numpy as np

np.random.seed(43)
df = pd.DataFrame({
    'cont_9': np.random.rand(10)*100,
    'cat_0': ['dog']*5 + ['cat']*5,
    'cat_1': ['wolf']*9 + ['tiger'] *1,
    'y':[1,0,1,1,1,1,0,0,0,0]
})

display(df)

      cont_9 cat_0  cat_1  y
0  11.505457   dog   wolf  1
1  60.906654   dog   wolf  0
2  13.339096   dog   wolf  1
3  24.058962   dog   wolf  1
4  32.713906   dog   wolf  1
5  85.913749   cat   wolf  1
6  66.609021   cat   wolf  0
7  54.116221   cat   wolf  0
8   2.901382   cat   wolf  0
9  73.374830   cat  tiger  0

In [ ]:
#lets calculate the mean value, of cat and dog
means0=df.groupby('cat_0')['y'].mean().to_dict()
means0

{'cat': 0.2, 'dog': 0.8}

**Grouping, Sorting and Shuffling**